In [20]:
phrase = "I'm Emily" # string
print(phrase)

I'm Emily

In [21]:
x = 5 # integer
y = 10 # integer
z = x + y # plus
print(z)
print(type(z))
z = y/x
print(z) # float
print(type(z))

15
<class 'int'>
2.0
<class 'float'>

In [22]:
a = 12
b = 4
c = a*b
print(c)

r = 2
p = 3.14
area = p * r**2
print(area)

48
12.56

In [23]:
name = "Emily"
job = "Performance and Development Manager"

phrase = f"My name is {name} and my job title is {job}"
print(phrase)
print(len(phrase))

string_slice = phrase[3:16]
print(string_slice)

filename ="here_is_a_file.csv"
filename = filename[:14]
print(filename)

My name is Emily and my job title is Performance and Development Manager
72
name is Emily
here_is_a_file

In [24]:
slice_this_phrase = "dog cat racoon"
slice_1 = slice_this_phrase[:3]
slice_2 = slice_this_phrase[4:7]
slice_3 = slice_this_phrase[-6:]
print(slice_1, slice_2, slice_3)

dog cat racoon

In [25]:
favourite_colour = "teal"
colours_list = ["red", "blue", "green"]
colours_list.append(favourite_colour)

print(f'My colours are: {colours_list}')

My colours are: ['red', 'blue', 'green', 'teal']

In [26]:
food_list = ["pizza", "cake", "chocolate"]
favourite_food = "cheesecake"
food_list.append(favourite_food)
print(food_list)

['pizza', 'cake', 'chocolate', 'cheesecake']

In [27]:
more_foods = ["ice cream", "pretzels"]
food_list.extend(more_foods)
print(food_list)
food_list.remove("pretzels")
print(food_list)
food_list.remove("pretzels")

['pizza', 'cake', 'chocolate', 'cheesecake', 'ice cream', 'pretzels']
['pizza', 'cake', 'chocolate', 'cheesecake', 'ice cream']

ValueError: list.remove(x): x not in list

In [ ]:
numbers_list = [2,3,4,5,1,6]
numbers_list.sort()
print(numbers_list)
numbers_list.sort(reverse=True)
print(numbers_list)

numbers_list = [2,3,4,5,1,6]
sorted_numbers = sorted(numbers_list)
print(sorted_numbers)

[1, 2, 3, 4, 5, 6]
[6, 5, 4, 3, 2, 1]
[1, 2, 3, 4, 5, 6]

In [ ]:
food_list_sorted = sorted(food_list, reverse=True)
print(food_list_sorted)

food_list.reverse()
print(food_list)

['pizza', 'ice cream', 'chocolate', 'cheesecake', 'cake']
['ice cream', 'cheesecake', 'chocolate', 'cake', 'pizza']

In [ ]:
people_favourite_colours = {'emily': 'pink',
                            'cat': 'blue',
                            'horse' : 23,
                            'Max': {'Tuesday': 'Green',
                                    'EOD':'Silver'}}

print(people_favourite_colours)
print(people_favourite_colours["Max"])
print(people_favourite_colours.keys())
print(people_favourite_colours.values())
print(people_favourite_colours.items())

{'emily': 'pink', 'cat': 'blue', 'horse': 23, 'Max': {'Tuesday': 'Green', 'EOD': 'Silver'}}
{'Tuesday': 'Green', 'EOD': 'Silver'}
dict_keys(['emily', 'cat', 'horse', 'Max'])
dict_values(['pink', 'blue', 23, {'Tuesday': 'Green', 'EOD': 'Silver'}])
dict_items([('emily', 'pink'), ('cat', 'blue'), ('horse', 23), ('Max', {'Tuesday': 'Green', 'EOD': 'Silver'})])

In [ ]:
dict_restaurant = {'pizza hut': 'pizza',
                            'nutmeg': 'indian',
                            'seven lucky gods' : 'japanese',
                            'cor': {'Tuesday': 'greek',
                                    'EOD':'spanish'}}

print(dict_restaurant)
print(dict_restaurant["cor"])
print(dict_restaurant.keys())
print(dict_restaurant.values())
print(dict_restaurant.items())

dict_restaurant['pasta loco'] = 'pasta'
dict_restaurant['cor']= 'french'
print(dict_restaurant)


print('franco manca' in dict_restaurant)
print('nutmeg' in dict_restaurant)

{'pizza hut': 'pizza', 'nutmeg': 'indian', 'seven lucky gods': 'japanese', 'cor': {'Tuesday': 'greek', 'EOD': 'spanish'}}
{'Tuesday': 'greek', 'EOD': 'spanish'}
dict_keys(['pizza hut', 'nutmeg', 'seven lucky gods', 'cor'])
dict_values(['pizza', 'indian', 'japanese', {'Tuesday': 'greek', 'EOD': 'spanish'}])
dict_items([('pizza hut', 'pizza'), ('nutmeg', 'indian'), ('seven lucky gods', 'japanese'), ('cor', {'Tuesday': 'greek', 'EOD': 'spanish'})])
{'pizza hut': 'pizza', 'nutmeg': 'indian', 'seven lucky gods': 'japanese', 'cor': 'french', 'pasta loco': 'pasta'}
False
True

In [ ]:
group_x_dict = {'Jon Maggs': 'performance and development manager',
           'Emily Dickson': 'performance analyst',
           'Will LP': 'python king',
           'paul dryden': 'senior p'}
names = list(group_x_dict.keys())
names_sorted = sorted(names)
print(group_x_dict)
group_x_dict.items()
for key, values in group_x_dict.items():
    print(f"My name is {key} and my job is {values}.")

{'Jon Maggs': 'performance and development manager', 'Emily Dickson': 'performance analyst', 'Will LP': 'python king', 'paul dryden': 'senior p'}
My name is Jon Maggs and my job is performance and development manager.
My name is Emily Dickson and my job is performance analyst.
My name is Will LP and my job is python king.
My name is paul dryden and my job is senior p.

In [3]:
import pandas as pd

dict_1 = {"heres's a column": ["val 1", "val 2", "val 3"],
         "col 2": [4,5,6],
          "col z": ["foo", "bar", "baz"] }

df_1 = pd.DataFrame(dict_1)
df_1

  heres's a column  col 2 col z
0            val 1      4   foo
1            val 2      5   bar
2            val 3      6   baz

In [53]:
corporation = [{"name":"Walter Boggis",
                  "job": "Chicken Farmer",
                  "salary" : 28000},
                  {"name":"Nathaniel Bunce",
                  "job": "Duck and Goose Farmer",
                  "salary" : 30000},
                  {"name":"Franklin Bean",
                  "job": "Cider Farmer",
                  "salary" : 12000},
                  {"name":"Mr Fox",
                  "job": "Thief",
                  "salary" : 50000},]

corp_df = pd.DataFrame(corporation)
corp_df

              name                    job  salary
0    Walter Boggis         Chicken Farmer   28000
1  Nathaniel Bunce  Duck and Goose Farmer   30000
2    Franklin Bean           Cider Farmer   12000
3           Mr Fox                  Thief   50000

In [54]:
# print(corp_df.info())
#print(corp_df.dtypes)
# print(corp_df.head(1))
# print(corp_df.tail(1))

In [55]:
corp_df["salary"] = corp_df["salary"].astype("int")
corp_df.dtypes

name      object
job       object
salary     int64
dtype: object

In [56]:
corp_salary_total = corp_df["salary"].sum()
corp_salary_mean = corp_df["salary"].mean()
corp_salary_cumsum = corp_df["salary"].cumsum()
# print(corp_salary_total)
sal_min_max = f"Salary minimum: {corp_df['salary'].min()}, salary maximum: {corp_df['salary'].max()}"
print(sal_min_max)

Salary minimum: 12000, salary maximum: 50000

In [57]:
corp_df['date started'] = ["05/02/2023", "12/04/2021", "16/03/2019", "19/03/2019"]
corp_df

              name                    job  salary date started
0    Walter Boggis         Chicken Farmer   28000   05/02/2023
1  Nathaniel Bunce  Duck and Goose Farmer   30000   12/04/2021
2    Franklin Bean           Cider Farmer   12000   16/03/2019
3           Mr Fox                  Thief   50000   19/03/2019

In [58]:
inflation = 1.067
corp_df["salary inc"] = corp_df["salary"] * inflation
corp_df["pay after bonus"] = corp_df["salary"] + 500
corp_df["salary inc"] = corp_df["salary inc"].astype("int")
#corp_df['date started'] = pd.to_datetime(corp_df['date started'], dayfirst=True)
corp_df['date started'] = pd.to_datetime(corp_df['date started'], format= '%d/%m/%Y')
corp_df.dtypes
corp_df

,name,job,salary,date started,salary inc,pay after bonus
0,Walter Boggis,Chicken Farmer,28000,2023-02-05,29876,28500
1,Nathaniel Bunce,Duck and Goose Farmer,30000,2021-04-12,32010,30500
2,Franklin Bean,Cider Farmer,12000,2019-03-16,12804,12500
3,Mr Fox,Thief,50000,2019-03-19,53350,50500

In [64]:
corp_df["birthday"] = ["04/06/1996", "05/05/2002","01/01/1914", "01/02/2002"]
corp_df['birthday'] = pd.to_datetime(corp_df['birthday'], format= '%d/%m/%Y')
corp_df['time served'] = pd.to_datetime("06/11/2023", format = "%d/%m/%Y") - corp_df['date started']
corp_df.dtypes
corp_df['time served'] = corp_df["time served"] / pd.Timedelta("365 days")
corp_df['time served'] = corp_df['time served'].round().astype("int", errors = "ignore")
corp_df

,name,job,salary,date started,salary inc,pay after bonus,birthday,time served
0,Walter Boggis,Chicken Farmer,28000,2023-02-05,29876,28500,1996-06-04,1
1,Nathaniel Bunce,Duck and Goose Farmer,30000,2021-04-12,32010,30500,2002-05-05,3
2,Franklin Bean,Cider Farmer,12000,2019-03-16,12804,12500,1914-01-01,5
3,Mr Fox,Thief,50000,2019-03-19,53350,50500,2002-02-01,5